[
  {
    "id": "1",
    "title": "Создать структуру проекта",
    "description": "Создать структуру проекта на основе выбранного стека технологий (React). Установить и настроить необходимые пакеты и библиотеки. В структуре проекта должны быть следующие папки: 'components' для размещения компонентов приложения, 'assets' для хранения статических файлов (изображений, стилей и т.д.), 'services' для хранения логики работы с API и других вспомогательных функций.",
    "priority": "1",
    "estimate": 0,
    "dependencies": []
  },
  {
    "id": "2",
    "title": "Реализовать компонент 'App'",
    "description": "Создать компонент 'App', который будет корневым компонентом приложения. Внутри компонента 'App' должен рендериться компонент 'MainScreen'. Данный компонент должен быть функциональным и написан на React. При разработке следует использовать React hooks.",
    "priority": "1",
    "estimate": 0,
    "dependencies": [
      "1"
    ]
  },
  {
    "id": "3",
    "title": "Реализовать компонент 'MainScreen'",
    "description": "Создать компонент 'MainScreen', который будет отображать слово 'Paphos' по центру экрана. Для стилизации использовать CSS-in-JS. Компонент должен быть адаптивным и корректно отображаться на разных устройствах и разрешениях экрана.",
    "priority": "1",
    "estimate": 0,
    "dependencies": [
      "2"
    ]
  },
  {
    "id": "4",
    "title": "Протестировать работу приложения",
    "description": "Провести тестирование приложения. Проверить корректность отображения компонента 'MainScreen' на разных устройствах и разрешениях экрана. Для тестирования использовать библиотеку Jest.",
    "priority": "1",
    "estimate": 0,
    "dependencies": [
      "3"
    ]
  },
  {
    "id": "5",
    "title": "Оптимизировать производительность приложения",
    "description": "Провести аудит производительности приложения с использованием инструментов разработчика Google Chrome (вкладка 'Performance'). Выявить возможные проблемы и устранить их. Убедиться, что приложение работает стабильно и без задержек.",
    "priority": "2",
    "estimate": 0,
    "dependencies": [
      "4"
    ]
  }
]
